In [1]:
import pandas as pd

In [5]:
pd.DataFrame([
    [1,'a'],
    [2,'b'],
    [3,'c']
], columns=['col1','col2'])

   col1 col2
0     1    a
1     2    b
2     3    c

In [6]:
data = {'col1':[1,2,3],'col2':['a','b','c']}
pd.DataFrame(data)

   col1 col2
0     1    a
1     2    b
2     3    c

In [18]:
# add index_col=0 into the parameter to remove auto indexing
df = pd.read_csv('data/AAPL_stock_price_example.csv')

# first 10 rows
#df.head(10)

# last 10 rows
#df.tail(10)

# 10 random rows
df.sample(10)

           Date       Close
66   2019-04-08  200.100006
176  2019-09-13  218.750000
19   2019-01-30  165.250000
126  2019-07-03  204.410004
103  2019-05-31  175.070007
86   2019-05-07  202.860001
200  2019-10-17  235.279999
37   2019-02-26  174.330002
180  2019-09-19  220.960007
223  2019-11-19  266.290009

In [19]:
df.isna().sum()

Date     0
Close    0
dtype: int64

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 229 entries, 0 to 228
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    229 non-null    object
 1   Close   229 non-null    float64
dtypes: float64(1), object(1)
memory usage: 3.7+ KB

In [54]:
df['Date'] = df['Date'].astype('string')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 229 entries, 0 to 228
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    229 non-null    string
 1   Close   229 non-null    float64
dtypes: float64(1), string(1)
memory usage: 3.7 KB

In [32]:
df['Date'].dtype

StringDtype

In [33]:
df.describe()

            Close
count  229.000000
mean   201.477598
std     28.246961
min    142.190002
25%    182.539993
50%    200.720001
75%    213.279999
max    267.100006

In [36]:
df[['Date']].describe()

              Date
count          229
unique         229
top     2019-01-29
freq             1

# Indexing

In [40]:
type(df['Close'])

pandas.core.series.Series

In [39]:
type(df[['Date','Close']])

pandas.core.frame.DataFrame

In [44]:
df.loc[40:]

# iloc will not include the ending index but loc will include the ending index

           Date       Close
40   2019-03-01  174.970001
41   2019-03-04  175.850006
42   2019-03-05  175.529999
43   2019-03-06  174.520004
44   2019-03-07  172.500000
..          ...         ...
224  2019-11-20  263.190002
225  2019-11-21  262.010010
226  2019-11-22  261.779999
227  2019-11-25  266.369995
228  2019-11-26  264.290009

[189 rows x 2 columns]

In [46]:
df.loc[40:,['Date']]

           Date
40   2019-03-01
41   2019-03-04
42   2019-03-05
43   2019-03-06
44   2019-03-07
..          ...
224  2019-11-20
225  2019-11-21
226  2019-11-22
227  2019-11-25
228  2019-11-26

[189 rows x 1 columns]

In [49]:
df.loc[df['Close']==200.100006]

          Date       Close
66  2019-04-08  200.100006

In [52]:
df.loc[df['Close']>200]

           Date       Close
66   2019-04-08  200.100006
68   2019-04-10  200.619995
73   2019-04-17  203.130005
74   2019-04-18  203.860001
75   2019-04-22  204.529999
..          ...         ...
224  2019-11-20  263.190002
225  2019-11-21  262.010010
226  2019-11-22  261.779999
227  2019-11-25  266.369995
228  2019-11-26  264.290009

[120 rows x 2 columns]